aroyer-qc/Digini/Peripheral/src/port/STM32F4xx/lib_class_STM32F4_i2s.cpp
/*******************************************************************************
                            Static Functions
*******************************************************************************/

/**
  * @brief  Initializes the Audio Codec audio interface (I2S)
  * @param  AudioFreq: Audio frequency to be configured for the I2S peripheral.
  */
static SystemState_e I2S3_Init(uint32_t AudioFreq)
{
    /* Initialize the hAudioOutI2s Instance parameter */
    hAudioOutI2s.Instance         = I2S3;

    /* Disable I2S block */
    __HAL_I2S_DISABLE(&hAudioOutI2s);

    /* I2S3 peripheral configuration */
    hAudioOutI2s.Init.AudioFreq   = AudioFreq;
    hAudioOutI2s.Init.ClockSource = I2S_CLOCK_PLL;
    hAudioOutI2s.Init.CPOL        = I2S_CPOL_LOW;
    hAudioOutI2s.Init.DataFormat  = I2S_DATAFORMAT_16B;
    hAudioOutI2s.Init.MCLKOutput  = I2S_MCLKOUTPUT_ENABLE;
    hAudioOutI2s.Init.Mode        = I2S_MODE_MASTER_TX;
    hAudioOutI2s.Init.Standard    = I2S_STANDARD;

    /* Initialize the I2S peripheral with the structure above */
    if(HAL_I2S_Init(&hAudioOutI2s) != HAL_OK)
    {
        return SYS_ERROR;
    }
    else
    {
        return SYS_READY;
    }
}

/**
  * @brief  Initializes wave recording.
  * @param  AudioFreq: Audio frequency to be configured for the I2S peripheral.
  * @param  BitRes: Audio frequency to be configured for the I2S peripheral.
  * @param  ChnlNbr: Audio frequency to be configured for the I2S peripheral.
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
SystemState_e BSP_AUDIO_IN_Init(uint32_t AudioFreq, uint32_t BitRes, uint32_t ChnlNbr)
{
    /* Configure PLL clock */
    BSP_AUDIO_IN_ClockConfig(&hAudioInI2s, AudioFreq, NULL);

    /* Configure the PDM library */
    /* On STM32F401-Discovery a single microphone is mounted, samples are duplicated
       to make stereo audio streams */
    PDMDecoder_Init(AudioFreq, ChnlNbr, 2);

    /* Configure the I2S peripheral */
    hAudioInI2s.Instance = I2S2;
    if(HAL_I2S_GetState(&hAudioInI2s) == HAL_I2S_STATE_RESET)
    {
        /* Initialize the I2S Msp: this __weak function can be rewritten by the application */
        BSP_AUDIO_IN_MspInit(&hAudioInI2s, NULL);
    }

    // Configure the I2S2
    I2S2_Init(AudioFreq);

    /* Return AUDIO_OK when all operations are correctly done */
    return SYS_READY;
}

/**
  * @brief  Starts audio recording.
  * @param  pbuf: Main buffer pointer for the recorded data storing
  * @param  size: Current size of the recorded buffer
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
SystemState_e BSP_AUDIO_IN_Record(uint16_t* pbuf, uint32_t size)
{
  HAL_I2S_Receive_DMA(&hAudioInI2s, pbuf, size);    // Start the process receive DMA
  return SYS_READY;                                 // Return AUDIO is OK when all operations are correctly done
}

/**
  * @brief  Stops audio recording.
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
SystemState_e BSP_AUDIO_IN_Stop(void)
{
    HAL_I2S_DMAStop(&hAudioInI2s);      // Call the Media layer pause function
    return SYS_READY;                   // Return AUDIO_OK when all operations are correctly done
}

/**
  * @brief  Pauses the audio file stream.
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
SystemState_e BSP_AUDIO_IN_Pause(void)
{
    HAL_I2S_DMAPause(&hAudioInI2s);     // Call the Media layer pause function */
    return SYS_READY;                   // Return AUDIO_OK when all operations are correctly done
}

/**
  * @brief  Resumes the audio file stream.
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
SystemState_e BSP_AUDIO_IN_Resume(void)
{
    HAL_I2S_DMAResume(&hAudioInI2s);    // Call the Media layer pause/resume function
    return SYS_READY;                   // Return AUDIO_OK when all operations are correctly done
}

/**
  * @brief  Controls the audio in volume level.
  * @param  Volume: Volume level to be set in percentage from 0% to 100% (0 for
  *         Mute and 100 for Max volume level).
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_IN_SetVolume(uint8_t Volume)
{
  /* Set the Global variable AudioInVolume */
  AudioInVolume = Volume;

  /* Return AUDIO_OK when all operations are correctly done */
  return AUDIO_OK;
}

/**
  * @brief  Converts audio format from PDM to PCM.
  * @param  PDMBuf: Pointer to data PDM buffer
  * @param  PCMBuf: Pointer to data PCM buffer
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
uint8_t BSP_AUDIO_IN_PDMToPCM(uint16_t *PDMBuf, uint16_t *PCMBuf)
{
  uint16_t AppPDM[INTERNAL_BUFF_SIZE/2];
  uint32_t index = 0;

  /* PDM Demux */
  for(index = 0; index<INTERNAL_BUFF_SIZE/2; index++)
  {
    AppPDM[index] = HTONS(PDMBuf[index]);
  }

  for(index = 0; index < DEFAULT_AUDIO_IN_CHANNEL_NBR; index++)
  {
    /* PDM to PCM filter */
    PDM_Filter((uint8_t*)&AppPDM[index], (uint16_t*)&(PCMBuf[index]), &PDM_FilterHandler[index]);
  }

  /* Duplicate samples since a single microphone in mounted on STM32F4-Discovery */
  for(index = 0; index < PCM_OUT_SIZE; index++)
  {
    PCMBuf[(index<<1)+1] = PCMBuf[index<<1];
  }

  /* Return AUDIO_OK when all operations are correctly done */
  return AUDIO_OK;
}
/**
  * @brief  Audio In Clock Config.
  * @param  hi2s: I2S handle
  * @param  AudioFreq: Audio frequency used to record the audio stream.
  * @param  Params : pointer on additional configuration parameters, can be NULL.
  * @note   This API is called by BSP_AUDIO_IN_Init()
  *         Being __weak it can be overwritten by the application
  */
__weak void BSP_AUDIO_IN_ClockConfig(I2S_HandleTypeDef *hi2s, uint32_t AudioFreq, void *Params)
{
  RCC_PeriphCLKInitTypeDef rccclkinit;

  /*Enable PLLI2S clock*/
  HAL_RCCEx_GetPeriphCLKConfig(&rccclkinit);
  /* PLLI2S_VCO Input = HSE_VALUE/PLL_M = 1 Mhz */
  if ((AudioFreq & 0x7) == 0)
  {
    /* Audio frequency multiple of 8 (8/16/32/48/96/192)*/
    /* PLLI2S_VCO Output = PLLI2S_VCO Input * PLLI2SN = 192 Mhz */
    /* I2SCLK = PLLI2S_VCO Output/PLLI2SR = 192/6 = 32 Mhz */
    rccclkinit.PeriphClockSelection = RCC_PERIPHCLK_I2S;
    rccclkinit.PLLI2S.PLLI2SN = 192;
    rccclkinit.PLLI2S.PLLI2SR = 6;
    HAL_RCCEx_PeriphCLKConfig(&rccclkinit);
  }
  else
  {
    /* Other Frequency (11.025/22.500/44.100) */
    /* PLLI2S_VCO Output = PLLI2S_VCO Input * PLLI2SN = 290 Mhz */
    /* I2SCLK = PLLI2S_VCO Output/PLLI2SR = 290/2 = 145 Mhz */
    rccclkinit.PeriphClockSelection = RCC_PERIPHCLK_I2S;
    rccclkinit.PLLI2S.PLLI2SN = 290;
    rccclkinit.PLLI2S.PLLI2SR = 2;
    HAL_RCCEx_PeriphCLKConfig(&rccclkinit);
  }
}

/**
  * @brief  BSP AUDIO IN MSP Init.
  * @param  hi2s: I2S handle
  * @param  Params : pointer on additional configuration parameters, can be NULL.
  */
__weak void BSP_AUDIO_IN_MspInit(I2S_HandleTypeDef *hi2s, void *Params)
{
  static DMA_HandleTypeDef hdma_i2sRx;
  GPIO_InitTypeDef  GPIO_InitStruct;

  /* Enable the I2S2 peripheral clock */
  I2S2_CLK_ENABLE();

  /* Enable I2S GPIO clocks */
  I2S2_SCK_GPIO_CLK_ENABLE();
  I2S2_MOSI_GPIO_CLK_ENABLE();

  /* I2S2 pins configuration: SCK and MOSI pins ------------------------------*/
  GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull      = GPIO_NOPULL;
  GPIO_InitStruct.Speed     = GPIO_SPEED_FAST;

  GPIO_InitStruct.Pin       = I2S2_SCK_PIN;
  GPIO_InitStruct.Alternate = I2S2_SCK_AF;
  HAL_GPIO_Init(I2S2_SCK_GPIO_PORT, &GPIO_InitStruct);

  GPIO_InitStruct.Pin       = I2S2_MOSI_PIN ;
  GPIO_InitStruct.Alternate = I2S2_MOSI_AF;
  HAL_GPIO_Init(I2S2_MOSI_GPIO_PORT, &GPIO_InitStruct);

  /* Enable the DMA clock */
  I2S2_DMAx_CLK_ENABLE();

